OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12f635.h
#define _CRREG0                 0x01
#define _CRREG1                 0x02
#define _ENC_NOT_DEC            0x40
#define _ENC_DEC                0x40
#define _GO_NOT_DONE            0x80
#define _GO                     0x80

//==============================================================================

extern __at(0x0111) __sfr CRDAT0;
extern __at(0x0112) __sfr CRDAT1;
extern __at(0x0113) __sfr CRDAT2;
extern __at(0x0114) __sfr CRDAT3;

//==============================================================================
//
//        Configuration Bits
//
//==============================================================================

#define _CONFIG                 0x2007

//----------------------------- CONFIG Options -------------------------------

#define _FOSC_LP                0x3FF8  // LP oscillator: Low-power crystal on RA5/T1CKI/OSC1/CLKIN and RA4/T1G/OSC2/CLKOUT.
#define _LP_OSC                 0x3FF8  // LP oscillator: Low-power crystal on RA5/T1CKI/OSC1/CLKIN and RA4/T1G/OSC2/CLKOUT.
#define _FOSC_XT                0x3FF9  // XT oscillator: Crystal/resonator on RA5/T1CKI/OSC1/CLKIN and RA4/T1G/OSC2/CLKOUT.
#define _XT_OSC                 0x3FF9  // XT oscillator: Crystal/resonator on RA5/T1CKI/OSC1/CLKIN and RA4/T1G/OSC2/CLKOUT.
#define _FOSC_HS                0x3FFA  // HS oscillator: High-speed crystal/resonator on RA5/T1CKI/OSC1/CLKIN and RA4/T1G/OSC2/CLKOUT.
#define _HS_OSC                 0x3FFA  // HS oscillator: High-speed crystal/resonator on RA5/T1CKI/OSC1/CLKIN and RA4/T1G/OSC2/CLKOUT.
#define _FOSC_EC                0x3FFB  // EC: I/O function on RA4/T1G/OSC2/CLKOUT, CLKIN on RA5/T1CKI/OSC1/CLKIN.
#define _EC_OSC                 0x3FFB  // EC: I/O function on RA4/T1G/OSC2/CLKOUT, CLKIN on RA5/T1CKI/OSC1/CLKIN.
#define _FOSC_INTOSCIO          0x3FFC  // INTOSCIO oscillator: I/O function on RA4/T1G/OSC2/CLKOUT pin, I/O function on RA5/T1CKI/OSC1/CLKIN.
#define _INTRC_OSC_NOCLKOUT     0x3FFC  // INTOSCIO oscillator: I/O function on RA4/T1G/OSC2/CLKOUT pin, I/O function on RA5/T1CKI/OSC1/CLKIN.
#define _FOSC_INTOSCCLK         0x3FFD  // INTOSC oscillator: CLKOUT function on RA4/T1G/OSC2/CLKOUT pin, I/O function on RA5/T1CKI/OSC1/CLKIN.
#define _INTRC_OSC_CLKOUT       0x3FFD  // INTOSC oscillator: CLKOUT function on RA4/T1G/OSC2/CLKOUT pin, I/O function on RA5/T1CKI/OSC1/CLKIN.
#define _FOSC_EXTRCIO           0x3FFE  // RCIO oscillator: I/O function on RA4/T1G/OSC2/CLKOUT pin, RC on RA5/T1CKI/OSC1/CLKIN.
#define _EXTRC_OSC_NOCLKOUT     0x3FFE  // RCIO oscillator: I/O function on RA4/T1G/OSC2/CLKOUT pin, RC on RA5/T1CKI/OSC1/CLKIN.
#define _FOSC_EXTRCCLK          0x3FFF  // RC oscillator: CLKOUT function on RA4/T1G/OSC2/CLKOUT pin, RC on RA5/T1CKI/OSC1/CLKIN.
#define _EXTRC_OSC_CLKOUT       0x3FFF  // RC oscillator: CLKOUT function on RA4/T1G/OSC2/CLKOUT pin, RC on RA5/T1CKI/OSC1/CLKIN.
#define _WDTE_OFF               0x3FF7  // WDT disabled and can be enabled by SWDTEN bit of the WDTCON register.
#define _WDT_OFF                0x3FF7  // WDT disabled and can be enabled by SWDTEN bit of the WDTCON register.
#define _WDTE_ON                0x3FFF  // WDT enabled.
#define _WDT_ON                 0x3FFF  // WDT enabled.
#define _PWRTE_ON               0x3FEF  // PWRT enabled.
#define _PWRTE_OFF              0x3FFF  // PWRT disabled.
#define _MCLRE_OFF              0x3FDF  // MCLR pin function is alternate function, MCLR function is internally disabled.
#define _MCLRE_ON               0x3FFF  // MCLR pin is MCLR function and weak internal pull-up is enabled.
#define _CP_ON                  0x3FBF  // Program memory is external read and write-protected.
#define _CP_OFF                 0x3FFF  // Program memory is not code protected.
#define _CPD_ON                 0x3F7F  // Data memory is external read protected.
#define _CPD_OFF                0x3FFF  // Data memory is not code protected.
#define _BOREN_OFF              0x3CFF  // BOD and SBODEN disabled.
#define _BOD_OFF                0x3CFF  // BOD and SBODEN disabled.
#define _BOREN_SBODEN           0x3DFF  // SBODEN controls BOD function.
#define _BOD_SBODEN             0x3DFF  // SBODEN controls BOD function.
#define _BOREN_NSLEEP           0x3EFF  // BOD enabled while running and disabled in Sleep. SBODEN bit disabled.
#define _BOD_NSLEEP             0x3EFF  // BOD enabled while running and disabled in Sleep. SBODEN bit disabled.
#define _BOREN_ON               0x3FFF  // BOD enabled and SBOdEN bit disabled.
#define _BOD_ON                 0x3FFF  // BOD enabled and SBOdEN bit disabled.
#define _IESO_OFF               0x3BFF  // Internal External Switchover mode disabled.
#define _IESO_ON                0x3FFF  // Internal External Switchover mode enabled.
#define _FCMEN_OFF              0x37FF  // Fail-Safe Clock Monitor disabled.
#define _FCMEN_ON               0x3FFF  // Fail-Safe Clock Monitor enabled.
#define _WURE_ON                0x2FFF  // Wake-up and Reset enabled.
#define _WUREN_ON               0x2FFF  // Wake-up and Reset enabled.
#define _WURE_OFF               0x3FFF  // Standard wake-up and continue enabled.
#define _WUREN_OFF              0x3FFF  // Standard wake-up and continue enabled.

//==============================================================================

#define _DEVID1                 0x2006

#define _IDLOC0                 0x2000
#define _IDLOC1                 0x2001
#define _IDLOC2                 0x2002
#define _IDLOC3                 0x2003

//==============================================================================

#ifndef NO_BIT_DEFINES

#define CM0                     CMCON0bits.CM0                  // bit 0
#define CM1                     CMCON0bits.CM1                  // bit 1
#define CM2                     CMCON0bits.CM2                  // bit 2
#define CIS                     CMCON0bits.CIS                  // bit 3
#define CINV                    CMCON0bits.CINV                 // bit 4, shadows bit in CMCON0bits
#define C1INV                   CMCON0bits.C1INV                // bit 4, shadows bit in CMCON0bits
#define COUT                    CMCON0bits.COUT                 // bit 6, shadows bit in CMCON0bits
#define C1OUT                   CMCON0bits.C1OUT                // bit 6, shadows bit in CMCON0bits

#define CMSYNC                  CMCON1bits.CMSYNC               // bit 0, shadows bit in CMCON1bits
#define C1SYNC                  CMCON1bits.C1SYNC               // bit 0, shadows bit in CMCON1bits
#define T1GSS                   CMCON1bits.T1GSS                // bit 1

#define CRREG0                  CRCONbits.CRREG0                // bit 0
#define CRREG1                  CRCONbits.CRREG1                // bit 1
#define ENC_NOT_DEC             CRCONbits.ENC_NOT_DEC           // bit 6, shadows bit in CRCONbits
#define ENC_DEC                 CRCONbits.ENC_DEC               // bit 6, shadows bit in CRCONbits
#define GO_NOT_DONE             CRCONbits.GO_NOT_DONE           // bit 7, shadows bit in CRCONbits
#define GO                      CRCONbits.GO                    // bit 7, shadows bit in CRCONbits

#define RD                      EECON1bits.RD                   // bit 0
#define WR                      EECON1bits.WR                   // bit 1
#define WREN                    EECON1bits.WREN                 // bit 2
#define WRERR                   EECON1bits.WRERR                // bit 3

