OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic12f635.h
#define GP0                     GPIObits.GP0                    // bit 0, shadows bit in GPIObits
#define RA0                     GPIObits.RA0                    // bit 0, shadows bit in GPIObits
#define GP1                     GPIObits.GP1                    // bit 1, shadows bit in GPIObits
#define RA1                     GPIObits.RA1                    // bit 1, shadows bit in GPIObits
#define GP2                     GPIObits.GP2                    // bit 2, shadows bit in GPIObits
#define RA2                     GPIObits.RA2                    // bit 2, shadows bit in GPIObits
#define GP3                     GPIObits.GP3                    // bit 3, shadows bit in GPIObits
#define RA3                     GPIObits.RA3                    // bit 3, shadows bit in GPIObits
#define GP4                     GPIObits.GP4                    // bit 4, shadows bit in GPIObits
#define RA4                     GPIObits.RA4                    // bit 4, shadows bit in GPIObits
#define GP5                     GPIObits.GP5                    // bit 5, shadows bit in GPIObits
#define RA5                     GPIObits.RA5                    // bit 5, shadows bit in GPIObits

#define RAIF                    INTCONbits.RAIF                 // bit 0
#define INTF                    INTCONbits.INTF                 // bit 1
#define T0IF                    INTCONbits.T0IF                 // bit 2
#define RAIE                    INTCONbits.RAIE                 // bit 3
#define INTE                    INTCONbits.INTE                 // bit 4
#define T0IE                    INTCONbits.T0IE                 // bit 5
#define PEIE                    INTCONbits.PEIE                 // bit 6
#define GIE                     INTCONbits.GIE                  // bit 7

#define IOCA0                   IOCAbits.IOCA0                  // bit 0
#define IOCA1                   IOCAbits.IOCA1                  // bit 1
#define IOCA2                   IOCAbits.IOCA2                  // bit 2
#define IOCA3                   IOCAbits.IOCA3                  // bit 3
#define IOCA4                   IOCAbits.IOCA4                  // bit 4
#define IOCA5                   IOCAbits.IOCA5                  // bit 5

#define LVDL0                   LVDCONbits.LVDL0                // bit 0
#define LVDL1                   LVDCONbits.LVDL1                // bit 1
#define LVDL2                   LVDCONbits.LVDL2                // bit 2
#define LVDEN                   LVDCONbits.LVDEN                // bit 4, shadows bit in LVDCONbits
#define PLVDEN                  LVDCONbits.PLVDEN               // bit 4, shadows bit in LVDCONbits
#define IRVST                   LVDCONbits.IRVST                // bit 5

#define PS0                     OPTION_REGbits.PS0              // bit 0
#define PS1                     OPTION_REGbits.PS1              // bit 1
#define PS2                     OPTION_REGbits.PS2              // bit 2
#define PSA                     OPTION_REGbits.PSA              // bit 3
#define T0SE                    OPTION_REGbits.T0SE             // bit 4
#define T0CS                    OPTION_REGbits.T0CS             // bit 5
#define INTEDG                  OPTION_REGbits.INTEDG           // bit 6
#define NOT_RAPU                OPTION_REGbits.NOT_RAPU         // bit 7

#define SCS                     OSCCONbits.SCS                  // bit 0
#define LTS                     OSCCONbits.LTS                  // bit 1
#define HTS                     OSCCONbits.HTS                  // bit 2
#define OSTS                    OSCCONbits.OSTS                 // bit 3
#define IRCF0                   OSCCONbits.IRCF0                // bit 4
#define IRCF1                   OSCCONbits.IRCF1                // bit 5
#define IRCF2                   OSCCONbits.IRCF2                // bit 6

#define TUN0                    OSCTUNEbits.TUN0                // bit 0
#define TUN1                    OSCTUNEbits.TUN1                // bit 1
#define TUN2                    OSCTUNEbits.TUN2                // bit 2
#define TUN3                    OSCTUNEbits.TUN3                // bit 3
#define TUN4                    OSCTUNEbits.TUN4                // bit 4

#define NOT_BOR                 PCONbits.NOT_BOR                // bit 0, shadows bit in PCONbits
#define NOT_BOD                 PCONbits.NOT_BOD                // bit 0, shadows bit in PCONbits
#define NOT_POR                 PCONbits.NOT_POR                // bit 1
#define NOT_WUR                 PCONbits.NOT_WUR                // bit 3
#define SBOREN                  PCONbits.SBOREN                 // bit 4, shadows bit in PCONbits
#define SBODEN                  PCONbits.SBODEN                 // bit 4, shadows bit in PCONbits
#define ULPWUE                  PCONbits.ULPWUE                 // bit 5

#define TMR1IE                  PIE1bits.TMR1IE                 // bit 0
#define OSFIE                   PIE1bits.OSFIE                  // bit 2
#define C1IE                    PIE1bits.C1IE                   // bit 3
#define CRIE                    PIE1bits.CRIE                   // bit 5
#define LVDIE                   PIE1bits.LVDIE                  // bit 6
#define EEIE                    PIE1bits.EEIE                   // bit 7

#define TMR1IF                  PIR1bits.TMR1IF                 // bit 0
#define OSFIF                   PIR1bits.OSFIF                  // bit 2
#define C1IF                    PIR1bits.C1IF                   // bit 3
#define CRIF                    PIR1bits.CRIF                   // bit 5
#define LVDIF                   PIR1bits.LVDIF                  // bit 6
#define EEIF                    PIR1bits.EEIF                   // bit 7

#define C                       STATUSbits.C                    // bit 0
#define DC                      STATUSbits.DC                   // bit 1
#define Z                       STATUSbits.Z                    // bit 2
#define NOT_PD                  STATUSbits.NOT_PD               // bit 3
#define NOT_TO                  STATUSbits.NOT_TO               // bit 4
#define RP0                     STATUSbits.RP0                  // bit 5
#define RP1                     STATUSbits.RP1                  // bit 6
#define IRP                     STATUSbits.IRP                  // bit 7

#define TMR1ON                  T1CONbits.TMR1ON                // bit 0
#define TMR1CS                  T1CONbits.TMR1CS                // bit 1
#define NOT_T1SYNC              T1CONbits.NOT_T1SYNC            // bit 2
#define T1OSCEN                 T1CONbits.T1OSCEN               // bit 3
#define T1CKPS0                 T1CONbits.T1CKPS0               // bit 4
#define T1CKPS1                 T1CONbits.T1CKPS1               // bit 5
#define TMR1GE                  T1CONbits.TMR1GE                // bit 6
#define T1GINV                  T1CONbits.T1GINV                // bit 7

#define TRISIO0                 TRISAbits.TRISIO0               // bit 0, shadows bit in TRISAbits
#define TRISA0                  TRISAbits.TRISA0                // bit 0, shadows bit in TRISAbits
#define TRISIO1                 TRISAbits.TRISIO1               // bit 1, shadows bit in TRISAbits
#define TRISA1                  TRISAbits.TRISA1                // bit 1, shadows bit in TRISAbits
#define TRISIO2                 TRISAbits.TRISIO2               // bit 2, shadows bit in TRISAbits
#define TRISA2                  TRISAbits.TRISA2                // bit 2, shadows bit in TRISAbits
#define TRISIO3                 TRISAbits.TRISIO3               // bit 3, shadows bit in TRISAbits
#define TRISA3                  TRISAbits.TRISA3                // bit 3, shadows bit in TRISAbits
#define TRISIO4                 TRISAbits.TRISIO4               // bit 4, shadows bit in TRISAbits
#define TRISA4                  TRISAbits.TRISA4                // bit 4, shadows bit in TRISAbits
#define TRISIO5                 TRISAbits.TRISIO5               // bit 5, shadows bit in TRISAbits
#define TRISA5                  TRISAbits.TRISA5                // bit 5, shadows bit in TRISAbits

#define VR0                     VRCONbits.VR0                   // bit 0
#define VR1                     VRCONbits.VR1                   // bit 1
#define VR2                     VRCONbits.VR2                   // bit 2
#define VR3                     VRCONbits.VR3                   // bit 3
#define VRR                     VRCONbits.VRR                   // bit 5
#define VREN                    VRCONbits.VREN                  // bit 7

#define WDA0                    WDAbits.WDA0                    // bit 0
#define WDA1                    WDAbits.WDA1                    // bit 1
#define WDA2                    WDAbits.WDA2                    // bit 2
#define WDA4                    WDAbits.WDA4                    // bit 4
#define WDA5                    WDAbits.WDA5                    // bit 5

#define SWDTEN                  WDTCONbits.SWDTEN               // bit 0
#define WDTPS0                  WDTCONbits.WDTPS0               // bit 1
#define WDTPS1                  WDTCONbits.WDTPS1               // bit 2
#define WDTPS2                  WDTCONbits.WDTPS2               // bit 3
#define WDTPS3                  WDTCONbits.WDTPS3               // bit 4

#define WPUDA0                  WPUDAbits.WPUDA0                // bit 0
#define WPUDA1                  WPUDAbits.WPUDA1                // bit 1
#define WPUDA2                  WPUDAbits.WPUDA2                // bit 2
#define WPUDA4                  WPUDAbits.WPUDA4                // bit 4
#define WPUDA5                  WPUDAbits.WPUDA5                // bit 5

#endif // #ifndef NO_BIT_DEFINES

#endif // #ifndef __PIC12F635_H__
